<?php

/*
 * 4. Объявить массив, индексами которого являются буквы русского языка, а
 * значениями – соответствующие латинские буквосочетания
 */

$s = "Это русская строка";
$s = strtr($s, array('а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ё'=>'e','ж'=>'j',
    'з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r',
    'с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'shch','ы'=>'y',
    'э'=>'e','ю'=>'yu','я'=>'ya','ъ'=>'','ь'=>''));

echo $s;

$s1 = "Это русская строка";
$new_name = transliterator_transliterate('Russian-Latin/BGN', $s1);
